In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
data=pd.read_csv('titanic.csv')
data.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [25]:
data.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [26]:
data.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [27]:
target=data.Survived

In [28]:
input =data.drop('Survived',axis='columns')

In [29]:
dumies=pd.concat([input],axis='columns')

In [30]:
input.head(3)

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250

In [31]:
input.drop('Sex',axis='columns',inplace=True)
input.head()

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000
4       3  35.0   8.0500

In [33]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [35]:
input.Age=input.Age.fillna(input.Age.mean())
input.head()

   Pclass   Age     Fare
0       3  22.0   7.2500
1       1  38.0  71.2833
2       3  26.0   7.9250
3       1  35.0  53.1000
4       3  35.0   8.0500

In [37]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(input,target,test_size=0.2)

In [40]:
x_train.head()

     Pclass        Age     Fare
367       3  29.699118   7.2292
335       3  29.699118   7.8958
417       2  18.000000  13.0000
213       2  30.000000  13.0000
462       1  47.000000  38.5000

In [42]:
x_test.head()

     Pclass        Age     Fare
701       1  35.000000  26.2875
573       3  29.699118   7.7500
630       1  80.000000  30.0000
422       3  29.000000   7.8750
817       2  31.000000  37.0042

In [44]:
from sklearn.naive_bayes import GaussianNB
nb=GaussianNB()
nb.fit(x_train,y_train)

GaussianNB()

In [46]:
nb.score(x_test,y_test)

0.7039106145251397

In [48]:
x_test[:10]

     Pclass        Age      Fare
701       1  35.000000   26.2875
573       3  29.699118    7.7500
630       1  80.000000   30.0000
422       3  29.000000    7.8750
817       2  31.000000   37.0042
744       3  31.000000    7.9250
725       3  20.000000    8.6625
877       3  19.000000    7.8958
438       1  64.000000  263.0000
816       3  23.000000    7.9250

In [50]:
y_test[:10]

701    1
573    1
630    1
422    0
817    0
744    1
725    0
877    0
438    0
816    0
Name: Survived, dtype: int64

In [52]:
nb.predict(x_test[:10])

array([1, 0, 1, 0, 0, 0, 0, 0, 1, 0], dtype=int64)

In [53]:
nb.predict_proba(x_test[:10])

array([[4.89793691e-01, 5.10206309e-01],
       [8.89270972e-01, 1.10729028e-01],
       [2.92842164e-01, 7.07157836e-01],
       [8.88437084e-01, 1.11562916e-01],
       [7.40460807e-01, 2.59539193e-01],
       [8.90871916e-01, 1.09128084e-01],
       [8.71484777e-01, 1.28515223e-01],
       [8.68392784e-01, 1.31607216e-01],
       [3.92418097e-12, 1.00000000e+00],
       [8.78180450e-01, 1.21819550e-01]])